app/views/maps/show.html.erb

SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 1]]
---
<%= javascript_tag do %>
  var map = L.map('map').setView([51.505, -0.09], 13);