app/controllers/maps_controller.rb

  def index
    @maps = Map.all
---
SELECT "maps".* FROM "maps"

  def create
    @map = Map.new(map_params)

    respond_to do |format|
      if @map.save
---
INSERT INTO "maps" ("start_location", "created_at", "updated_at") VALUES (?, ?, ?)  [["start_location", "boston"], ["created_at", "2015-09-10 02:32:11.736749"], ["updated_at", "2015-09-10 02:32:11.736749"]]

  def update
    respond_to do |format|
      if @map.update(map_params)
---
UPDATE "maps" SET "start_location" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["start_location", "[43.58089, -71.21407]"], ["updated_at", "2015-09-11 03:41:36.880590"], ["id", 2]]

    def set_map
      @map = Map.find(params[:id])
---
SELECT  "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", 2]]